//Замикання
// Функція лічильник
function counter() {
    //Змінна яка доступна внутрішній функції, та буде збільшуватись з кожним її викликом, але недоступна ззовеы
    var count = 1;
    return function () {
        //Збільшуємо лічильник, тут відбувається замикання функції на змінній, а змінна замикається на ф-цію
        console.log(count++);
    };
}
//Створюємо нову функцію, результатом якої буде ф-ція, яка повертається з лічильника
var c = counter();

//При кожному виклику лічильник збільшується на 1
c();
c();
c();
c();